# Curve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Grid..::..Curve Property
Grid Class See Also
---
Retrieves an object that represents the geometry of the grid line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve Curve { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Curve As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ Curve {
	Curve^ get ();
}
```

# Remarks
The geometry can either be an arc or a curve. The IsCurved property can be used to determine this.
# See Also
Grid Class
Autodesk.Revit.DB Namespace